# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.14-s082_1 on Thu Apr 09 02:20:57 IST 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design cpu_core

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_load -pin_load 0.1 [get_ports {imem_addr[31]}]
set_load -pin_load 0.1 [get_ports {imem_addr[30]}]
set_load -pin_load 0.1 [get_ports {imem_addr[29]}]
set_load -pin_load 0.1 [get_ports {imem_addr[28]}]
set_load -pin_load 0.1 [get_ports {imem_addr[27]}]
set_load -pin_load 0.1 [get_ports {imem_addr[26]}]
set_load -pin_load 0.1 [get_ports {imem_addr[25]}]
set_load -pin_load 0.1 [get_ports {imem_addr[24]}]
set_load -pin_load 0.1 [get_ports {imem_addr[23]}]
set_load -pin_load 0.1 [get_ports {imem_addr[22]}]
set_load -pin_load 0.1 [get_ports {imem_addr[21]}]
set_load -pin_load 0.1 [get_ports {imem_addr[20]}]
set_load -pin_load 0.1 [get_ports {imem_addr[19]}]
set_load -pin_load 0.1 [get_ports {imem_addr[18]}]
set_load -pin_load 0.1 [get_ports {imem_addr[17]}]
set_load -pin_load 0.1 [get_ports {imem_addr[16]}]
set_load -pin_load 0.1 [get_ports {imem_addr[15]}]
set_load -pin_load 0.1 [get_ports {imem_addr[14]}]
set_load -pin_load 0.1 [get_ports {imem_addr[13]}]
set_load -pin_load 0.1 [get_ports {imem_addr[12]}]
set_load -pin_load 0.1 [get_ports {imem_addr[11]}]
set_load -pin_load 0.1 [get_ports {imem_addr[10]}]
set_load -pin_load 0.1 [get_ports {imem_addr[9]}]
set_load -pin_load 0.1 [get_ports {imem_addr[8]}]
set_load -pin_load 0.1 [get_ports {imem_addr[7]}]
set_load -pin_load 0.1 [get_ports {imem_addr[6]}]
set_load -pin_load 0.1 [get_ports {imem_addr[5]}]
set_load -pin_load 0.1 [get_ports {imem_addr[4]}]
set_load -pin_load 0.1 [get_ports {imem_addr[3]}]
set_load -pin_load 0.1 [get_ports {imem_addr[2]}]
set_load -pin_load 0.1 [get_ports {imem_addr[1]}]
set_load -pin_load 0.1 [get_ports {imem_addr[0]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[31]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[30]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[29]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[28]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[27]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[26]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[25]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[24]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[23]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[22]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[21]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[20]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[19]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[18]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[17]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[16]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[15]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[14]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[13]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[12]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[11]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[10]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[9]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[8]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[7]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[6]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[5]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[4]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[3]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[2]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[1]}]
set_load -pin_load 0.1 [get_ports {dmem_addr[0]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[31]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[30]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[29]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[28]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[27]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[26]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[25]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[24]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[23]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[22]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[21]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[20]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[19]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[18]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[17]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[16]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[15]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[14]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[13]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[12]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[11]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[10]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[9]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[8]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[7]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[6]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[5]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[4]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[3]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[2]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[1]}]
set_load -pin_load 0.1 [get_ports {dmem_wdata[0]}]
set_load -pin_load 0.1 [get_ports dmem_we]
set_load -pin_load 0.1 [get_ports dmem_re]
set_false_path -from [get_ports rst_n]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_rdata[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_rdata[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {imem_addr[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_addr[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dmem_wdata[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports dmem_we]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports dmem_re]
set_max_fanout 10.000 [current_design]
set_max_transition 0.5 [current_design]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports rst_n]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[31]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[30]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[29]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[28]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[27]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[26]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[25]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[24]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[23]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[22]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[21]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[20]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[19]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[18]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[17]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[16]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[15]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[14]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[13]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[12]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[11]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[10]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[9]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[8]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[7]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[6]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[5]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[4]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[3]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[2]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[1]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {imem_rdata[0]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[31]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[30]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[29]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[28]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[27]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[26]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[25]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[24]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[23]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[22]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[21]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[20]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[19]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[18]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[17]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[16]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[15]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[14]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[13]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[12]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[11]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[10]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[9]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[8]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[7]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[6]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[5]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[4]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[3]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[2]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[1]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {dmem_rdata[0]}]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.2 [get_clocks clk]
set_clock_uncertainty -hold 0.2 [get_clocks clk]
